openfoam_cases/xifoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          XiFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-5;

/* maxDeltaT       1e-04; */

/* adjustTimeStep  off; */

writeControl    adjustableRunTime;

writeInterval   0.0001;

purgeWrite      0;

writeFormat     ascii;

writePrecision    7;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable true;

adjustTimeStep yes;

maxCo  0.60;
/* libs            ("libtabulatedFluidReactionThermophysicalTransportModels.so"); */

maxDeltaT 1;


// ************************************************************************* //
