openfoam_cases/xifoam/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            constantbXiIgnition;

    select          cellZone;
    cellZone        ignition;

    start           0.00;
    duration        0.001;
    strength        1;

    XiCorr
    {
        type            spherical;
        select          all;
    }
}


// ************************************************************************* //
