openfoam_cases/xifoam/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.85;

boundaryField
{
    
    // X0
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    //     value           $internalField;
    // }
    top {
        type            calculated;
        value           uniform 0;
        Prt             0.85;
    }
    XL
    {
        type            calculated;
        value           uniform 0;
        Prt             0.85;
    }

    "(border).*"
    {
        type            zeroGradient;
    }
    
    "(sym).*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
