openfoam_cases/xifoam/0.orig/fu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{
    // X0
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    //     value           $internalField;
    // }
    XL
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    top {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }

    "(border).*"
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    border_liquid
    {
        type fixedValue;
        value uniform 0.05;
    }

    "(sym).*"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
